import type { Particle } from '../types';

export const PARTICLES_MOCK: Particle[] = [
  {
    id: 1,
    name: "Электрон",
    mass: 9.109384e-31,
    description: "В атоме электрон движется вокруг ядра, образуя электронные оболочки со скоростью, близкой к скорости света. Количество электронов в оболочке определяет ее энергию и форму, а также определяет свойства атома, такие как химические свойства и атомный номер. Электрон является фермионом, то есть частицей, подчиняющейся статистике Ферми-Дирака и имеющей полуцелое значение спина. В физике используется как пример элементарной частицы, потому что он имеет наименьшую массу из всех известных частиц.",
  },
  {
    id: 2,
    name: "Протон",
    mass: 1.672622e-27,
    description: "Протон — одна из трёх (вместе с нейтроном и электроном) элементарных частиц, из которых построено обычное вещество. Протоны входят в состав атомных ядер; порядковый номер химического элемента в таблице Менделеева равен количеству протонов в его ядре. Спин протона равен 1/2, поэтому протоны подчиняются статистике Ферми-Дирака. У протона существует античастица – антипротон. Название «протон» предложено Э. Резерфордом в 1920 году.",
  },
  {
    id: 3,
    name: "Нейтрон",
    mass: 1.674928e-27,
    description: "Нейтрон (от лат. neuter — ни тот, ни другой) — тяжёлая субатомная частица, не имеющая электрического заряда. Открыт в 1932 г. Дж. Чедвиком. Спин нейтрон равен 1/2. В свободном состоянии нейтрон нестабилен – распадается на протон, электрон и антинейтрино; время жизни составляет примерно 886 с. Так как нейтрон электрически нейтрален, он легко проникает в атомные ядра при любой энергии и с большой вероятностью вызывает ядерные реакции.",
  },
  {
    id: 4,
    name: "Альфа-частица",
    mass: 6.644657e-27,
    description: "Альфа-частица — положительно заряженная частица, образованная двумя протонами и двумя нейтронами; ядро атома гелия-4. Впервые обнаружены Эрнестом Резерфордом в 1899 году и он же дал название этому виду излучения. Альфа-частицы могут вызывать ядерные реакции; в первой искусственно вызванной ядерной реакции, проведённой Э. Резерфордом в 1919 году (превращение ядер азота в ядра кислорода) участвовали именно альфа-частицы. Поток альфа-частиц называют альфа-излучением.",
  },
  {
    id: 5,
    name: "Мюон",
    mass: 1.883532e-28,
    description: "Мюон — нестабильная заряженная элементарная частица со спином 1/2 и временем жизни 2,2 мкс. Мюон имеет античастицу. Мюоны были открыты Карлом Андерсоном и Сетом Неддермайером в 1937 году, во время исследования космического излучения. Они обнаружили частицы, которые при прохождении через магнитное поле отклонялись в меньшей степени, чем электроны, но сильнее, чем протоны.",
  },
  {
    id: 6,
    name: "Тау-лептон",
    mass: 3.167541e-27,
    description: "Тау-лептон, таон (от греческой буквы греч. τ — тау, использующейся для обозначения) — нестабильная элементарная частица с отрицательным электрическим зарядом и спином 1/2. В Стандартной Модели физики элементарных частиц классифицируется как часть лептонного семейства фермионов (вместе с электроном, мюоном и нейтрино). Тау-лептон имеет античастицу с зарядом противоположного знака, но с равной массой и спином: антитау-лептон (антитаон). Тау-лептон был открыт в 1975 году на электрон-позитронном коллайдере в Национальной ускорительной лаборатории.",
  },
  {
    id: 7,
    name: "Бозон Хиггса",
    mass: 2.232122e-25,
    description: "Бозон Хиггса — в современной теории элементарных частиц это неделимая частика, которая отвечает за механизм появления масс у некоторых других элементарных частиц. В 1964 году британский физик Питер Хиггс вместе с другими учеными предположил, что существует особое поле, при взаимодействии с которым частицы приобретают массу. Позже его назвали полем Хиггса, а процесс обретения массы — хиггсовским механизмом. Изучить, как работает этот процесс, можно только через измерения свойств хиггсовского бозона. Без обнаружения бозона изучить это поле не удавалось.",
  },
];
